package main.java.phsimulation.messages;

public final class WelcomeMessages {
    public static final String BANNER = """
                    ⬛⬛🦊🦊🦊🦊⬛🐇🐇🐇⬛🌱⬛⬛⬛🌱⬛🗻⬛⬛⬛🗻⬛🏝️⬛⬛⬛⬛⬛⬛🦊⬛⬛⬛🐇🐇🐇🐇🐇⬛🗻🗻🗻⬛⬛🌱🌱🌱⬛⬛🏝️⬛⬛⬛🏝️⬛
                    ⬛🦊⬛⬛⬛⬛⬛⬛🐇⬛⬛🌱🌱⬛🌱🌱⬛🗻⬛⬛⬛🗻⬛🏝️⬛⬛⬛⬛⬛🦊⬛🦊⬛⬛⬛⬛🐇⬛⬛⬛⬛🗻⬛⬛🌱⬛⬛⬛🌱⬛🏝️🏝️️⬛⬛🏝️⬛
                    ⬛⬛🦊🦊🦊⬛⬛⬛🐇⬛⬛🌱⬛🌱⬛🌱⬛🗻⬛⬛⬛🗻⬛🏝️⬛⬛⬛⬛🦊⬛⬛⬛🦊⬛⬛⬛🐇⬛⬛⬛⬛🗻⬛⬛🌱⬛⬛⬛🌱⬛🏝️⬛🏝️️⬛🏝️⬛
                    ⬛⬛⬛⬛⬛🦊⬛⬛🐇⬛⬛🌱⬛⬛⬛🌱⬛🗻⬛⬛⬛🗻⬛🏝️⬛⬛⬛⬛🦊🦊🦊🦊🦊⬛⬛⬛🐇⬛⬛⬛⬛🗻⬛⬛🌱⬛⬛⬛🌱⬛🏝️⬛⬛🏝️️🏝️⬛
                    ⬛⬛⬛⬛⬛🦊⬛⬛🐇⬛⬛🌱⬛⬛⬛🌱⬛🗻⬛⬛⬛🗻⬛🏝️⬛⬛⬛⬛🦊⬛⬛⬛🦊⬛⬛⬛🐇⬛⬛⬛⬛🗻⬛⬛🌱⬛⬛⬛🌱⬛🏝️⬛⬛⬛🏝️⬛
                    ⬛🦊🦊🦊🦊⬛⬛🐇🐇🐇⬛🌱⬛⬛⬛🌱⬛⬛🗻🗻🗻⬛⬛🏝️🏝️🏝️🏝️⬛🦊⬛⬛⬛🦊⬛⬛⬛🐇⬛⬛⬛🗻🗻🗻⬛⬛🌱🌱🌱⬛⬛🏝️⬛⬛⬛🏝️️⬛
                    """;

    public static final String WELCOME_MESSAGE = """
                                                                  ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
                                                                    Добро пожаловать в симуляцию!
                                                                  ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
                    
                    Это пошаговая симуляция реального мира, где 🦊 хищники охотятся на 🐇 травоядных, а те питаются 🌱 травой.
                    Желаю интересного наблюдения!
                    """;

    private WelcomeMessages() {}

    public static void printWelcomeMessages() {
        System.out.println(BANNER);
        System.out.println(WELCOME_MESSAGE);
    }
}
